{
    "Realiseert Software": ["Student heeft XAMMP/alternatief werkend geïnstaleerd. Op dit platform wordt een werkend product is gepresenteerd.","Student kan 5 HTML tags. 5 CSS onderwerpen: benoem 3 tags, leg uit hoe nesting werkt. Leg een zelfgemaakte Javascript functie uit die gebruik maakt van parameters.","Student kan een database maken met gebruikersrechten. Is in staat om nette code te schrijven met een combinatie van JavaScript,HTML,CSS & PHP zoals behandeld in workshops.//comments en structuur","Student kan een ERD, Functioneel/Technisch ontwerp, MOSCOW en Usecases maken. Kan de 4 basisprincipes van OOP uitleggen iclusief een eenvoudeige toepassing.","Student presenteert zelfgemaakte software in een tweede programmeertaal en kan dit uitleggen. Kan een gebruikte debug strategie uitleggen.","Student heeft tweede programmeertaal gekozen. Legt de geleerde code uit van een verdiepende challenge.","Student laat in minimaal 2 afgeronde challenges waarvan 1 met een bedrijf het volgende zien: Opdracht definitie, planning en bewakin, Ontwerpdocument volledig uit padlet ingevuld, Kan software uitleggen, Tesplan, Testlog en Tesverslag volledig ingevuld, Verbetervoorstellen geven adhv begindefinitie"],
    "Werken in een ontwikkelteam": ["Student voert een project uit  in een groep en lost eventuele conflicten aantoonbaar op.","Student kan samenwerken in een groepje en weet wat hun rol hierin is. Laat zien dat hij een presentatie kan geven.","Student reflecteert op eigen rol binnen het team via Belbin test.Laat zien dat hij een presentatie kan geven rekening houdend met zijn/haar doelgroep.","Student reflecteert op eigen rol binnen het team en toont aan dat ze feedback kunnen geven aan teamleden.  Student plant werkzaamheden eb deze zijn aantoonbaaar adhv een stand up meetingsverslag en een planning.","Student reflecteert volgens de STARR- methode op eigen rol binnen het team.","Student toont aan dat hij/zij feedback kan geven aan teamleden.","Student heeft een 360-graden feedback uitgevoerd en reflecteert hierop.","Student presenteerd zijn challenge op een professionele manier.","Student heeft actief deelgenemonen aan een team met een duidelijke rol en vastgelegde afspraken. Presenteerd op een proffesionele manier een product. Student reflecteert op eigen productdeel, eigen rol, teamverband en gedrag. Bv. STARR"],
    "Generieke onderdelen RE": ["Rekenlicentie aangeschaft & H1-6","H7-13","H14-18"],
    "Generieke onderdelen BS": ["Beloning: '*'","Heeft zich verdiept in de dimensie Sociaal Maatschappelijk, heeft een mening over normen en waarden en verschillen tusssen individuen en heeft dit aangetoond in een infographic.","Heeft zich verdiept in de dimensie gezondheid, heeft een mening over beroepsziekten en het belang van gezondheid in het algemeen en heeft dit aangetoond in een infographic.","Heeft zich verdiept in de dimensie politiek, heeft een mening over diverse politieke stromingen, heeft kennis van het Nederlandse kiessysteen, 1e en 2e kamer en trias politica en heeft dit aangetoond in een infographi.","Heeft zich verdiept in de dimensie economie, heeft zich verdiept in de kosten die een student in Nederland heeft, welke verzekeringen verplicht zijn na de leeftijd van 18 jaar en heeft kennis van belastingen in Nederland en heeft dit aangetoond in een infographic","Interview bij de stagebegeleider van het BPV bedrijf over hoe de vier dimensies een plek krijgen in de organisatie en geeft een advies voor verbetering op basis van het interview.","Neemt de burgerschapsdimensies op in uitwerking van de challenges. Doet voorstel voor acties challenge owner."],
    "Generieke onderdelen NE": ["Student heeft drie verschillende 'Nederlands-Bricks' succesvol voltooid.","null","null","Student heeft een presentatie-opdracht op 3F-niveau voltooid.","Student heeft een schrijfopdracht op 3F-niveau voltooid.","Student heeft een oefenexamen Lezen/Luisteren op 3F-niveau voltooid.","Student heeft alle examens voor Nederlands behaald."],
    "Generieke onderdelen EN": ["Beloning: '*'","Opdrachten voor A2 lezen en luisteren ERK niveau lezen: Ik kan zeer korte eenvoudige teksten lezen. Ik kan specifieke voorspelbare informatie vinden in eenvoudige, alledaagse teksten zoals advertenties, folders, menu's en dienstregelingen en ik kan korte, eenvoudige, persoonlijke brieven begrijpen. ERK niveau luisteren: Ik kan zinnen en de meest frequente woorden begrijpen die betrekking hebben op gebieden die van direct persoonlijk belang zijn (bijvoorbeeld basisinformatie over mezelf en mijn familie, winkelen, plaatselijke omgeving, werk). Ik kan de belangrijkste punten in korte, duidelijke eenvoudige boodschappen en aankondigingen volgen.","Opdrachten voor A2 schrijven en gesprekken voeren ERK niveau schrijven: Ik kan korte, eenvoudige notities en boodschappen opschrijven. Ik kan een zeer eenvoudige persoonlijke brief schrijven, bijvoorbeeld om iemand voor iets te bedanken. ERK niveau gesprekken voeren: Ik kan communiceren over eenvoudige en alledaagse taken die een eenvoudige en directe uitwisseling van informatie over vertrouwde onderwerpen en activiteiten betreffen. Ik kan zeer korte sociale gesprekken aan, alhoewel ik gewoonlijk niet voldoende begrijp om het gesprek zelfstandig gaande te houden.","Opdrachten voor A2 vocabulair en spreken ERK niveau spreken: Ik kan een reeks uitdrukkingen en zinnen gebruiken om in eenvoudige bewoordingen mijn familie en andere mensen, leefomstandigheden, mijn opleiding en mijn huidige of meest recente baan te beschrijven.","Opdrachten voor B1 lezen en luisteren ERK niveau lezen: Ik kan teksten begrijpen die hoofdzakelijk bestaan uit hoogfrequente, alledaagse of aan mijn werk gerelateerde taal. Ik kan de beschrijving van gebeurtenissen, gevoelens en wensen in persoonlijke brieven begrijpen. ERK niveau luisteren: Ik kan de hoofdpunten begrijpen wanneer in duidelijk uitgesproken standaarddialect wordt gesproken over vertrouwde zaken die ik regelmatig tegenkom op mijn werk, school, vrije tijd enz. Ik kan de hoofdpunten van veel radio- of tvprogramma’s over actuele zaken of over onderwerpen van persoonlijk of beroepsmatig belang begrijpen, wanneer er betrekkelijk langzaam en duidelijk gesproken wordt.","TBA","Opdrachten voor B1 vocabulair en spreken Examen spreken, gesprek voeren, schrijven ERK niveau spreken: Ik kan uitingen op een simpele manier aan elkaar verbinden, zodat ik ervaringen en gebeurtenissen, mijn dromen, verwachtingen en ambities kan beschrijven. Ik kan in het kort redenen en verklaringen geven voor mijn meningen en plannen. Ik kan een verhaal vertellen, of de plot van een boek of film weergeven en mijn reacties beschrijven."],
    "Generieke onderdelen LB": ["TBA","Maak een profiel aan bij Leo Loopbaan. Doe de test 'jouw plek in de wereld van werk' Reflecteer hierop. Maak de loopbaanopdracht belemmering of kans in Leo Loopbaan. En reflecteer.","Maak in Leo Loopbaan de tests 'Persoonlijkheidstype', 'Kwaliteitentest' en 'Beroepenzelfonderzoek' schrijf een reflectie over de uitkomsten, je kunt uitleg geven over de uitkomsten wat je over jezelf leerde.","Maak in Leo Loopbaan de tests 'Waardentest', 'Competentiescan' en 'Employebility' schrijf een reflectie over de uitkomsten, je kunt uitleg geven over de uitkomsten wat je over jezelf leerde.","Maak een LinkedIn profiel aan, je kunt hierover uitleggen wat belangrijk is. Maak een CV."],
    "Gedrag, Professionaliteit, Persoonlijke ontwikkeling": ["Ik weet wat er van me verwacht wordt bij het op tijd komen. Ik heb alle licenties in orde en weet wat ik moet doen voor de AVO vakken.","Ik weet wat ik van de opleiding vind en wat mijn volgende stappen gaan zijn in deze opleiding. Ik benoem 1 sterk punt en 1 ontwikkelpunt van mijzelf.","Ik ben helemaal bekend met hoe ik een challenge moet uitvoeren, hoe ik informatie krijg, workshops aanvraag alles voor het behalen van een go voor een challenge","Doe de loopbaanopdracht Energiegevers en energievreters in Leo Loopbaan en reflecteer.","Doe de loopbaanopdracht Je ideale werkomgeving in Leo Loopbaan en reflecteer.","Je laat zien dat je met een bedrijf een challenge hebt uitgevoerd. Van deze ervaring schrijf je een STARR reflectie.","Je komt je afspraken na, bent actief in je team en lost voorkomende problemen op, bent proactief neemt verantwoordelijkheid voor het proces en neemt actief deel aan stand-up meetings en reflecteert hierop en geeft feedback op je collega's"]
  }